# OffsetfacesShowShapeHandles Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..OffsetfacesShowShapeHandles Property
ParameterTypeId Class See Also
---
"Show Shape Handles"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId OffsetfacesShowShapeHandles { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property OffsetfacesShowShapeHandles As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ OffsetfacesShowShapeHandles {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace